{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-Data",
    "10": "I-Profissao",
    "2": "I-Data",
    "3": "B-Local",
    "4": "I-Local",
    "5": "B-Organizacao",
    "6": "I-Organizacao",
    "7": "B-Pessoa",
    "8": "I-Pessoa",
    "9": "B-Profissao"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-Data": "1",
    "B-Local": "3",
    "B-Organizacao": "5",
    "B-Pessoa": "7",
    "B-Profissao": "9",
    "I-Data": "2",
    "I-Local": "4",
    "I-Organizacao": "6",
    "I-Pessoa": "8",
    "I-Profissao": "10",
    "O": "0"
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.52.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 29794
}
